app/views/posts/index.html.erb

      <p class="card-subtitle text-muted" style="font-size: 0.8rem;">
        <%= post.user.first_name %> <%= post.user.last_name %>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1