app/views/posts/show.html.erb

      <i class="material-icons">person_outline</i>
      <span><%= @post.user.first_name %> <%= @post.user.last_name %></span>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1


<h2 class="my-3" style="font-size: 20px">Comentários (<span><%= @post.comments.size %></span>)</h2>

<% @post.comments.each do |comment| %>
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 4
SELECT COUNT(*) FROM `comments` WHERE `comments`.`post_id` = 4

      <article class="col-xl-8">
        <h5 class="mb-2 mt-2 font-weight-bold"><span><%= comment.user.nil? ? 'Anônimo' : comment.user.first_name %></span> disse:</h5>
---
SELECT `users`.* FROM `users` WHERE `users`.`comment_id` = 20 LIMIT 1