app/controllers/comments_controller.rb

INSERT INTO `comments` (`body`, `post_id`, `user_id`, `created_at`, `updated_at`) VALUES ('Novo comentário! Uhul!', 1, 1, '2021-10-02 22:36:06.071217', '2021-10-02 22:36:06.071217')
---
  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save