app/controllers/posts_controller.rb

SELECT COUNT(*) FROM `posts`
SELECT `posts`.* FROM `posts` ORDER BY `posts`.`created_at` ASC LIMIT 25 OFFSET 0
---
  def index
    @posts = Post.order("created_at DESC").page params[:page]

INSERT INTO `posts` (`title`, `content`, `user_id`, `created_at`, `updated_at`) VALUES ('Exercícios diários ajudam a', 'bla bla bla bla', 1, '2021-10-04 02:37:55.599493', '2021-10-04 02:37:55.599493')
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE `posts` SET `posts`.`title` = 'Top 6 linguagens de programação', `posts`.`updated_at` = '2021-10-04 01:45:59.820449' WHERE `posts`.`id` = 8
---
  def update
    respond_to do |format|
      if @post.update(post_params)

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 8 LIMIT 1
---
  def correct_user
    # Se o user logado não tiver um amigo com o id informado, não autorizar
    @user = current_user.posts.find_by(id: params[:id])